Documents/ПринятиеВРаботуОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПринятиеВРаботуОрганизации</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ЗагрузкаДанныхДолжника</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.ЗавершениеРаботыОрганизации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
				<xr:Item>Document.ЗагрузкаДанных</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
				<xr:Item>AccumulationRegister.ОбъектыВРаботе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОтветственныеСотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеСотрудники</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СотрудникиВПомощь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиВПомощь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидКонтроля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидКонтроля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отсутствие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АктПередачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>АктПередачи</Name>
			<Comment>Трейд Софт</Comment>
			<BasedOn>
				<xr:Item>Document.ПринятиеВРаботуОрганизации</xr:Item>
				<xr:Item>Document.АктПередачи</xr:Item>
				<xr:Item>Document.СкорингДолговыхОбязательств</xr:Item>
				<xr:Item>Document.ФормированиеПретензионногоПисьма</xr:Item>
				<xr:Item>Document.ЗавершениеРаботыОрганизации</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.ЗагрузкаЗадолженности</xr:Item>
				<xr:Item>Document.АктуализацияЗадолженности</xr:Item>
				<xr:Item>Document.ПоступлениеПлатежей</xr:Item>
				<xr:Item>Document.ЗаданияДляАвтоинформирования</xr:Item>
				<xr:Item>Document.ПередачаНаВыполнение</xr:Item>
				<xr:Item>Document.ЗапускБП</xr:Item>
				<xr:Item>Document.ПередатьДела</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СобытияПоОбъектам</xr:Item>
				<xr:Item>AccumulationRegister.ОбъектыВРаботе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПередающее</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПередающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПринимающее</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПринимающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудникаПередающего</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БылГлавнымГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудникаПринимающего</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначитьГлавнымГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеНазначатьСотрудников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзменялРС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
								<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПринятиеВРаботуОрганизации/Ext/ObjectModule.bsl
Процедура ОбработкаУдаленияПроведения(Отказ)
	//ПроведениеСервер.ОчиститьДвиженияДокумента(ЭтотОбъект,, Отказ); 
	ЭтотОбъект.Движения.ОбъектыВРаботе.Записывать = Истина;
	ЭтотОбъект.Движения.СобытияПоОбъектам.Записывать = Истина;
	ЭтотОбъект.Движения.Записать();
	Отказ = ПроведениеСервер.ПроверитьВозможностьПроведенияНов(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ТаблицаДвиженийОбъекты = Неопределено;
	ТаблицаДвиженийСобытия = Неопределено;	
	
	Документы.ПринятиеВРаботуОрганизации.ИнициализироватьДанныеДокумента(ЭтотОбъект, ТаблицаДвиженийОбъекты, 
			ТаблицаДвиженийСобытия);
						
	ПроведениеСервер.ВыполнитьКонтрольДвиженийОбъектов(ТаблицаДвиженийОбъекты, 
			Перечисления.ВидКонтроля.Наличие, Отказ);
			
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не Отказ И ТаблицаДвиженийОбъекты.Количество() > 0 Тогда
		ЭтотОбъект.Движения.ОбъектыВРаботе.Загрузить(ТаблицаДвиженийОбъекты);
		ЭтотОбъект.Движения.ОбъектыВРаботе.Записывать = Истина;
	КонецЕсли;		
			
	Если Не Отказ И ТаблицаДвиженийСобытия.Количество() > 0 Тогда
		ЭтотОбъект.Движения.СобытияПоОбъектам.Загрузить(ТаблицаДвиженийСобытия);
		ЭтотОбъект.Движения.СобытияПоОбъектам.Записывать = Истина;
	КонецЕсли;
	
	ЭтотОбъект.Движения.Записать();	
	
	//МассивОбъектов = ЭтотОбъект.Объекты.ВыгрузитьКолонку("Объект");
	//Отказ = НЕ ОбъектыСервер.СинхронизироватьРегистры_ОбъектыВРаботе(МассивОбъектов);
	//Если Отказ Тогда 
	//	Возврат;
	//КонецЕсли;
	
	Отказ = ПроведениеСервер.ПроверитьВозможностьПроведенияНов(ЭтотОбъект);
	
	Если Не Отказ Тогда
		//1) принятие в работу ответственных сотрудников (без проверки на уволенного, 
		//   т.к. это надо вычищать при отметке, что уволен)
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ПринятиеВРаботуОрганизацииОбъекты.Объект
		                      |ПОМЕСТИТЬ Таблица
		                      |ИЗ
		                      |	Документ.ПринятиеВРаботуОрганизации.Объекты КАК ПринятиеВРаботуОрганизацииОбъекты
		                      |ГДЕ
		                      |	ПринятиеВРаботуОрганизацииОбъекты.Ссылка = &Ссылка
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ОтветственныеСотрудники.Объект,
		                      |	ОтветственныеСотрудники.Пользователь КАК Пользователь
		                      |ПОМЕСТИТЬ ТаблицаОбъед
		                      |ИЗ
		                      |	Таблица КАК Таблица
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
		                      |		ПО Таблица.Объект = ОтветственныеСотрудники.Объект
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	СотрудникиВПомощь.Объект,
		                      |	СотрудникиВПомощь.Пользователь
		                      |ИЗ
		                      |	Таблица КАК Таблица
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВПомощь КАК СотрудникиВПомощь
		                      |		ПО Таблица.Объект = СотрудникиВПомощь.Объект
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ТаблицаОбъед.Объект,
		                      |	ТаблицаОбъед.Пользователь КАК Пользователь
		                      |ИЗ
		                      |	ТаблицаОбъед КАК ТаблицаОбъед
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	ТаблицаОбъед.Объект,
		                      |	ТаблицаОбъед.Пользователь
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Пользователь
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	Таблица.Объект
		                      |ИЗ
		                      |	Таблица КАК Таблица
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеСотрудники КАК ОтветственныеСотрудники
		                      |		ПО Таблица.Объект = ОтветственныеСотрудники.Объект
		                      |			И (ОтветственныеСотрудники.ТипСотрудника = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыСотрудников.РуководительПодразделения))
		                      |ГДЕ
		                      |	ОтветственныеСотрудники.Объект ЕСТЬ NULL 
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	Таблица.Объект");
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		Пакет = Запрос.ВыполнитьПакет();
		Результат = Пакет[2].Выбрать();
			
		ТекДок = Неопределено;
		Пока Результат.Следующий() Цикл			
			Если ТекДок <> Неопределено И ТекДок.СотрудникПринимающий <> Результат.Пользователь Тогда
				Попытка
					ТекДок.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Сообщить(ОписаниеОшибки());
					Отказ = Истина;
					Возврат;
				КонецПопытки;
				ТекДок = Неопределено;	
			КонецЕсли;
			
			Если ТекДок = Неопределено Тогда
				ТекДок = Документы.АктПередачи.СоздатьДокумент();
				ТекДок.Дата = ЭтотОбъект.Дата + 1;
				ТекДок.Автор = ЭтотОбъект.Ссылка;
				ТекДок.Организация = ЭтотОбъект.Организация;
				ТекДок.ПодразделениеПринимающее = Результат.Пользователь.Подразделение;
				ТекДок.СотрудникПринимающий = Результат.Пользователь;
				ТекДок.НеНазначатьСотрудников = Истина;
			КонецЕсли;
			
			ТекДок.Объекты.Добавить().Объект = Результат.Объект;	
		КонецЦикла;
		
		Если ТекДок <> Неопределено Тогда
			Попытка
				ТекДок.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ОписаниеОшибки());
				Отказ = Истина;
				Возврат;
			КонецПопытки;
		КонецЕсли;
		
		//2) назначение руководителя подразделения в случае отсутствия, на автора документа, если не Неопределено.	
		Если Не Пакет[3].Пустой() И ТипЗнч(ЭтотОбъект.Автор) = Тип("СправочникСсылка.Пользователи") Тогда
			ТекДок = Документы.АктПередачи.СоздатьДокумент();
			ТекДок.Дата = ЭтотОбъект.Дата + 1;
			ТекДок.Автор = ЭтотОбъект.Ссылка;
			ТекДок.Организация = ЭтотОбъект.Организация;
			ТекДок.ПодразделениеПринимающее = ЭтотОбъект.Автор.Подразделение;
			ТекДок.СотрудникПринимающий = ЭтотОбъект.Автор;
			ТекДок.ТипСотрудникаПринимающего = ЭтотОбъект.Автор.ТипСотрудника;
			
			ТекДок.Объекты.Загрузить(Пакет[3].Выгрузить());			
			Попытка
				ТекДок.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				Сообщить(ОписаниеОшибки());
				Отказ = Истина;
				Возврат;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	Эл = Блокировка.Добавить("Константа.СинхронизацияДанныхЗапущена");
	Эл.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	Если Константы.СинхронизацияДанныхЗапущена.Получить() = Ложь Тогда
		Константы.СинхронизацияДанныхЗапущена.Установить(Истина);	
	КонецЕсли;
	//////Попытка 
	//////	ФоновыеЗадания.Выполнить("ОбъектыСервер.СинхронизироватьРегистры_ОбъектыВРаботе",,"02");
	//////Исключение
	//////	Сообщить(ОписаниеОшибки());
	//////КонецПопытки;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ОбъектыСервер.ОбработкаЗаполненияДокументов(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
КонецПроцедуры
